Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказНаЭмиссиюКодовМаркировкиСУЗ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗаказНаЭмиссиюКодовМаркировкиИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроизводственногоЗаказа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроизводственнойЛинии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроизводственныйОбъектИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъектИдентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъектАдрес</Name>
					<Comment>Внутренние значения полей адреса доставки (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъектАдресСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВводаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВводаВОборотСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаНачалаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентГосИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВвезенПослеДатыОбязательнойМаркировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриобретенПроизведенПослеДатыОбязательнойМаркировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисПровайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисПровайдерыСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторЗаявкиИСМП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплатыКодовМаркировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатыКодовМаркировкиСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговораСОператором</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговораСОператором</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидСредстваИдентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСредствИдентификацииСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидМаркировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркировкиСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLNОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GLN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПолученияИзготовленныхКИЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СерийныеНомера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Comment>Код товара в ИС МП</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныКодовМаркировкиСУЗ</v8:Type>
								<v8:Type>cfg:EnumRef.ШаблоныКодовМаркировкиСУЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяРозничнаяЦена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаГосИСНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособФормированияСерийногоНомера</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыФормированияСерийногоНомераСУЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевойПол</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЦелевойПолИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВводаВОборот</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВводаВОборотСУЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварныйЗнак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозрастнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВозрастныеКатегорииИСМП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьШаблонЭтикетки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УдалитьШаблоныЭтикетокСУЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКИЗ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКиЗГИСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерКИЗ</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РазмерыКиЗГИСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиВладельца</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВладелецGTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентГосИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОписаниеНоменклатурыИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОписаниеНоменклатурыИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕмкостьПотребительскойУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВПотребительскойУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантЧастичногоВыбытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаЧастичногоВыбытияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВариантИспользованияЕдиницыХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияЕдиницыХраненияИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотребительскаяУпаковка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УпаковкаЧастичногоВыбытия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлючВидовПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторыВидовПродукции</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИсточникОписанияНоменклатурыИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаказНаЭмиссиюКодовМаркировкиСУЗ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		Товары.Очистить();
		СерийныеНомера.Очистить();
	КонецЕсли;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("ДанныеПула") Тогда
			
			ДокументОснование = ДанныеЗаполнения.ДокументОснование;
			ТоварнаяГруппа    = ДанныеЗаполнения.ТоварнаяГруппа;
			
			Для Каждого СтрокаТЧ Из ДанныеЗаполнения.Товары Цикл
				ЗаполнитьЗначенияСвойств(Товары.Добавить(), СтрокаТЧ);
			КонецЦикла;
			
			ДополнительныеСвойства.Вставить("НеЗаполнятьТабличнуюЧасть");
			
			ТипДанныхЗаполнения = ТипЗнч(ДокументОснование);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.МаркировкаТоваровИСМП") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = ТипДанныхЗаполнения Тогда
			ДокументОснование = ДанныеЗаполнения;
		КонецЕсли;
		
		ЗаполнитьПоМаркировке(ДокументОснование);
		
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПеремаркировкаТоваровИСМП") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = ТипДанныхЗаполнения Тогда
			ДокументОснование = ДанныеЗаполнения;
		КонецЕсли;
		
		ЗаполнитьПоПеремаркировке(ДокументОснование);
		
	КонецЕсли;
	
	ИнтеграцияИСМППереопределяемый.ОбработкаЗаполненияДокумента(ЭтотОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка);
	ЗаполнитьИдентификаторыСтрокТабличнойЧастиТовары();
	
	ЗаполнитьОбъектПоСтатистике();
	
	ИнтеграцияИСМППереопределяемый.ЗаполнитьКодыТНВЭДПоНоменклатуреВТабличнойЧасти(Товары);
	
	ЗаполнитьСпособФормированияСерийныхНомеровПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	МассивНепроверяемыхРеквизитов.Добавить("СервисПровайдер");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ВозрастнаяКатегория");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Модель");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ЦелевойПол");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.СрокГодности");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Наименование");
	
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Шаблон");
	МассивНепроверяемыхРеквизитов.Добавить("Контрагент");
	МассивНепроверяемыхРеквизитов.Добавить("СпособВводаВОборот");
	МассивНепроверяемыхРеквизитов.Добавить("GLNОрганизации");
	МассивНепроверяемыхРеквизитов.Добавить("НомерДоговораСОператором");
	МассивНепроверяемыхРеквизитов.Добавить("ДатаДоговораСОператором");
	МассивНепроверяемыхРеквизитов.Добавить("СпособПолучения");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.ВидКИЗ");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.РазмерКИЗ");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.КодТНВЭД");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.СпособВводаВОборот");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.СпособФормированияСерийногоНомера");
	МассивНепроверяемыхРеквизитов.Добавить("ИдентификаторПроизводственнойЛинии");
	МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйОбъектИдентификатор");
	МассивНепроверяемыхРеквизитов.Добавить("ПроизводственныйОбъектАдресСтрокой");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Номенклатура");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.Характеристика");
	МассивНепроверяемыхРеквизитов.Добавить("Товары.GTIN");
	
	ЭтоМаркировкаОстатков = СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков;
	
	ЭтоМаркировкаВнеПроизводстваИмпорта = СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаВнеПроизводстваИмпорта;
	Если ЭтоМаркировкаВнеПроизводстваИмпорта Тогда
		ПотребительскиеШаблоны = ИнтеграцияИСМПКлиентСервер.ШаблоныКодовПоВидуПродукции(ТоварнаяГруппа, 0);
	КонецЕсли;
	
	ШаблонСообщения       = НСтр("ru = 'Не заполнена колонка ""%1"" в строке %2 списка ""Товары""'");
	
	ВидыПродукцииПоТоварнойГруппе = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(ТоварнаяГруппа);
	ОбязательныеРеквизиты         = Новый Массив;
	
	МножествоДоступныхШаблонов = ИнтеграцияИСМПКлиентСервер.ШаблоныКодовПоВидуПродукции(ТоварнаяГруппа, 3).Количество() > 1;
	
	Если МножествоДоступныхШаблонов Тогда
		ОбязательныеРеквизиты.Добавить("Товары.Шаблон");
	КонецЕсли;
		
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеПоляКонтрагент(ВидыПродукцииПоТоварнойГруппе, СпособВводаВОборот) Тогда
		ОбязательныеРеквизиты.Добавить("Контрагент");
	КонецЕсли;
		
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеСпособаВводаВОборот(ВидыПродукцииПоТоварнойГруппе) Тогда
		ОбязательныеРеквизиты.Добавить("СпособВводаВОборот");
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеGLNОрганизации(ВидыПродукцииПоТоварнойГруппе,
			Перечисления.ВидыОперацийИСМП.ЗаказНаЭмиссиюКодовМаркировки) Тогда
		ОбязательныеРеквизиты.Добавить("GLNОрганизации");
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеДоговораСОператором(ВидыПродукцииПоТоварнойГруппе) Тогда
		ОбязательныеРеквизиты.Добавить("ДатаДоговораСОператором");
		ОбязательныеРеквизиты.Добавить("НомерДоговораСОператором");
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеСпособаПолучения(ВидыПродукцииПоТоварнойГруппе) Тогда
		ОбязательныеРеквизиты.Добавить("СпособПолучения");
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеВидаКИЗ(ВидыПродукцииПоТоварнойГруппе) Тогда
		ОбязательныеРеквизиты.Добавить("Товары.ВидКИЗ");
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеРазмераКИЗ(ВидыПродукцииПоТоварнойГруппе) Тогда
		ОбязательныеРеквизиты.Добавить("Товары.РазмерКИЗ");
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеКодаТНВЭДВТабличнойЧасти(ВидыПродукцииПоТоварнойГруппе) Тогда
		ОбязательныеРеквизиты.Добавить("Товары.КодТНВЭД");
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеСпособаВводаВОборотВТабличнойЧасти(ВидыПродукцииПоТоварнойГруппе) Тогда
		ОбязательныеРеквизиты.Добавить("Товары.СпособВводаВОборот");
	КонецЕсли;
		
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеСпособаФормированияСерийныхНомеров(ВидыПродукцииПоТоварнойГруппе) Тогда
		ОбязательныеРеквизиты.Добавить("Товары.СпособФормированияСерийногоНомера");
	КонецЕсли;	
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеПоляИдентификаторПроизводственнойЛинии(ВидыПродукцииПоТоварнойГруппе,
		СпособВводаВОборот) Тогда
		ОбязательныеРеквизиты.Добавить("ИдентификаторПроизводственнойЛинии");
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеПоляИдентификаторПроизводственногоОбъекта(ВидыПродукцииПоТоварнойГруппе,
		СпособВводаВОборот) Тогда
		ОбязательныеРеквизиты.Добавить("ПроизводственныйОбъектИдентификатор");
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеПоляПроизводственныйОбъектАдресСтрокой(ВидыПродукцииПоТоварнойГруппе,
		СпособВводаВОборот) Тогда
		ОбязательныеРеквизиты.Добавить("ПроизводственныйОбъектАдресСтрокой");
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеПоляНоменклатураВТабличнойЧасти(ВидыПродукцииПоТоварнойГруппе,
		СпособВводаВОборот) Тогда
		Если Не (ЗаказНаЭмиссиюСУЗКлиентСервер.ДоступноПолеБезУчетаНоменклатуры(ВидыПродукцииПоТоварнойГруппе,
			СпособВводаВОборот) И БезУчетаНоменклатуры) Тогда
			ОбязательныеРеквизиты.Добавить("Товары.Номенклатура");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеПоляGTIN(ВидыПродукцииПоТоварнойГруппе, СпособВводаВОборот) Тогда
		ОбязательныеРеквизиты.Добавить("Товары.GTIN");
	КонецЕсли;
	
	ДокументОтправлен = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ДокументОтправлен(Ссылка);
	
	Если ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеПоляПриобретенПроизведенПослеДатыОбязательнойМаркировки(
		ВидыПродукцииПоТоварнойГруппе, СпособВводаВОборот) И Не ПриобретенПроизведенПослеДатыОбязательнойМаркировки
		И Не ДокументОтправлен Тогда

		ДатаОбязательнойМаркировки = КонструкторИСМПОбщегоНазначенияКлиентСервер.ДатаНачалаПроизводства(ВидыПродукцииПоТоварнойГруппе);
		РеквизитыМетаданного       = Метаданные.Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Реквизиты;

		Если ДатаОбязательнойМаркировки <> Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Поле ""%1 %2"" не заполнено'"),
				РеквизитыМетаданного.ПриобретенПроизведенПослеДатыОбязательнойМаркировки.Синоним, Формат(
				ДатаОбязательнойМаркировки, "ДФ=dd.MM.yyyy;"));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,
				РеквизитыМетаданного.ПриобретенПроизведенПослеДатыОбязательнойМаркировки.Имя, , Отказ);
		КонецЕсли;
		
	КонецЕсли;
		
	Если ЭтоМаркировкаОстатков Тогда
		ПараметрыОписанияОстатков = Неопределено;
		ПолноеОписание            = ИнтеграцияИСМПКлиентСервер.ИспользованиеСпособаОписанияОстатков(ВидыПродукцииПоТоварнойГруппе);
	КонецЕсли;
	
	КонтролироватьЕМРЦ = КонструкторИСМПОбщегоНазначенияКлиентСервер.КонтролироватьЕдинуюМинимальнуюЦенуТабачныхИзделий(
		ВидыПродукцииПоТоварнойГруппе) И Не ДокументОтправлен;
	Если КонтролироватьЕМРЦ Тогда
		ДанныеЕМРЦ = ОбщегоНазначенияИСМП.МинимальнаяЦенаРозничнойПродажиТабачнойПродукции();
		ЕМРЦ       = ДанныеЕМРЦ.МинРЦ;
	КонецЕсли;
		
	// Проверки табличной части
	Для Каждого СтрокаТовары Из Товары Цикл
		
		// описание остатков
		Если ЭтоМаркировкаОстатков Тогда
			
			КонтрольОписанияОстатков = Истина;
			
			Если ПолноеОписание <> Неопределено Тогда
				КонтрольОписанияОстатков = Не ПолноеОписание;
			ИначеЕсли ЗначениеЗаполнено(СтрокаТовары.GTIN) Тогда
				КонтрольОписанияОстатков = Ложь;
			КонецЕсли;
			
			Если Не КонтрольОписанияОстатков И Не ЗначениеЗаполнено(СтрокаТовары.GTIN) Тогда
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru = 'GTIN'"), СтрокаТовары.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", СтрокаТовары.НомерСтроки, "GTIN"),,
					Отказ);
					
			КонецЕсли;
			
			Если КонтрольОписанияОстатков Тогда
				
				ПараметрыОписанияОстатков = ИнтеграцияИСМПКлиентСервер.ИспользованиеПараметровОписанияОстатковПоВидуПродукции(
						ВидыПродукцииПоТоварнойГруппе,
						ИнтеграцияИСМПКлиентСервер.КодТНВЭДДляПередачиВИСМП(СтрокаТовары.КодТНВЭД, ВидыПродукцииПоТоварнойГруппе));
					
				Если Не ЗначениеЗаполнено(СтрокаТовары.КодТНВЭД) Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения,
						НСтр("ru = 'Код ТНВЭД'"), СтрокаТовары.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Товары", СтрокаТовары.НомерСтроки, "КодТНВЭД"),,
						Отказ);
				КонецЕсли;
					
				Если ПараметрыОписанияОстатков.ИспользоватьЦелевойПол
					И Не ЗначениеЗаполнено(СтрокаТовары.ЦелевойПол) Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения,
						НСтр("ru = 'Целевой пол'"), СтрокаТовары.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Товары", СтрокаТовары.НомерСтроки, "ЦелевойПол"),,
						Отказ);
				КонецЕсли;
				
				Если ПараметрыОписанияОстатков.ИспользоватьВозрастнуюКатегорию
					И Не ЗначениеЗаполнено(СтрокаТовары.ВозрастнаяКатегория) Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения,
						НСтр("ru = 'Возрастная категория'"), СтрокаТовары.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Товары", СтрокаТовары.НомерСтроки, "ВозрастнаяКатегория"),,
						Отказ);
				КонецЕсли;
				
				Если ПараметрыОписанияОстатков.ИспользоватьМодель
					И Не ЗначениеЗаполнено(СтрокаТовары.Модель) Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения,
						НСтр("ru = 'Модель'"), СтрокаТовары.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Товары", СтрокаТовары.НомерСтроки, "Модель"),,
						Отказ);
				КонецЕсли;
				
				Если ПараметрыОписанияОстатков.ИспользоватьСпособВводаВОборот
					И Не ЗначениеЗаполнено(СтрокаТовары.СпособВводаВОборот) Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения,
						НСтр("ru = 'Способ ввода в оборот'"), СтрокаТовары.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Товары", СтрокаТовары.НомерСтроки, "СпособВводаВОборот"),,
						Отказ);
				КонецЕсли;
				
				Если ПараметрыОписанияОстатков.ИспользоватьНаименование
					И Не ЗначениеЗаполнено(СтрокаТовары.Наименование)
					И Не ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
					ТекстСообщения = СтрШаблон(ШаблонСообщения,
						НСтр("ru = 'Наименование'"), СтрокаТовары.НомерСтроки);
					ОбщегоНазначения.СообщитьПользователю(
						ТекстСообщения,
						ЭтотОбъект,
						ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
							"Товары", СтрокаТовары.НомерСтроки, "Наименование"),,
						Отказ);
				КонецЕсли;
				
			КонецЕсли;
		
		ИначеЕсли Не ЗаказНаЭмиссиюСУЗКлиентСервер.ПроверятьЗаполнениеПоляНоменклатураВТабличнойЧасти(ВидыПродукцииПоТоварнойГруппе,
			СпособВводаВОборот) Тогда
			
			Если ЗначениеЗаполнено(СтрокаТовары.Номенклатура)
				И Не ЗначениеЗаполнено(СтрокаТовары.GTIN) Тогда
				
				ТекстСообщения = СтрШаблон(ШаблонСообщения, НСтр("ru = 'GTIN'"), СтрокаТовары.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", СтрокаТовары.НомерСтроки, "GTIN"),,
					Отказ);
					
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЭтоМаркировкаВнеПроизводстваИмпорта Тогда
			
			Если ПотребительскиеШаблоны.НайтиПоЗначению(СтрокаТовары.Шаблон) = Неопределено Тогда
				ТекстСообщения = СтрШаблон(
					НСтр("ru = 'Для способа ввода в оборот %1 доступно указание только потребительских упаковок'"), СпособВводаВОборот);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,
					ЭтотОбъект,
					ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", СтрокаТовары.НомерСтроки, "Шаблон"),,
					Отказ);
			КонецЕсли;
			
		КонецЕсли;
		
		Если КонтролироватьЕМРЦ Тогда
			Если СтрокаТовары.МаксимальнаяРозничнаяЦена < ЕМРЦ Тогда
				ТекстСообщения = СтрШаблон(НСтр(
					"ru = 'В строке %1 списка ""Товары"" значение МРЦ меньше единой минимальной цены на табачные изделия равной %2 руб.'"),
					СтрокаТовары.НомерСтроки, Формат(ЕМРЦ, "ЧДЦ=2"));
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
						"Товары", СтрокаТовары.НомерСтроки, "МаксимальнаяРозничнаяЦена"), , Отказ);
			КонецЕсли;
		КонецЕсли;
	
	КонецЦикла;
		
	ИнтеграцияИСМППереопределяемый.ПриОпределенииОбработкиПроверкиЗаполнения(
		ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	НепроверяемыеРеквизиты = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МассивНепроверяемыхРеквизитов, ОбязательныеРеквизиты);
	
	ПроверитьСпособФормированияСерийныхНомеров(Отказ);
	ПроверитьЗаполнениеСерийныхНомеров(Отказ);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ИдентификаторПроизводственногоЗаказа) Тогда
		ИдентификаторПроизводственногоЗаказа = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;
	
	ШаблонВидаПродукции = ИнтеграцияИСМПКлиентСервер.ШаблонКодаМаркировкиПоВидуПродукции(ТоварнаяГруппа);
	
	Если ЗначениеЗаполнено(ТипОплатыКодовМаркировки)
		И Не ЗаказНаЭмиссиюСУЗКлиентСервер.ДоступноПолеТипОплатыКодовМаркировки(ТоварнаяГруппа) Тогда
		ТипОплатыКодовМаркировки = Неопределено;
	КонецЕсли;
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ИдентификаторСтроки) Тогда
			СтрокаТЧ.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Шаблон) Тогда
			СтрокаТЧ.Шаблон = ШаблонВидаПродукции;
		КонецЕсли;
	КонецЦикла;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ИнтеграцияИСПереопределяемый.ПередЗаписьюОбъекта(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДействиеЗапроситеGTINНаОстатки = Перечисления.ДальнейшиеДействияПоВзаимодействиюИСМП.ЗапроситеGTINНаОстатки;
	ТребуетсяЗапросGTIN            = Документы.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ТребуетсяЗапросGTIN(ЭтотОбъект);
	ДальнейшееДействие1            = РегистрыСведений.СтатусыДокументовИСМП.ТекущееСостояние(Ссылка).ДальнейшееДействие1;
	Если (ТребуетсяЗапросGTIN
		И ДальнейшееДействие1 <> ДействиеЗапроситеGTINНаОстатки)
		Или (Не ТребуетсяЗапросGTIN
		И ДальнейшееДействие1 = ДействиеЗапроситеGTINНаОстатки) Тогда
		ДополнительныеСвойства.Вставить("ТребуетсяПерезаписьСтатусаПоУмолчанию", Истина);
	КонецЕсли;
	
	ОбменДаннымиИСМП.ЗаписатьСтатусДокументаПоУмолчанию(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование   = Неопределено;
	ИдентификаторЗаявки = Неопределено;
	СерийныеНомера.Очистить();
	ИдентификаторПроизводственногоЗаказа = "";
	ИдентификаторПроизводственнойЛинии   = "";
	
	ПроверитьАктуальностьСпособаВводаВОборот();

	Для Каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.СпособФормированияСерийногоНомера = Перечисления.СпособыФормированияСерийногоНомераСУЗ.Самостоятельно Тогда
			СтрокаТЧ.СтатусУказанияСерии = 1;
		Иначе
			СтрокаТЧ.СтатусУказанияСерии = 2;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработкаЗаполнения

Процедура ЗаполнитьСпособФормированияСерийныхНомеровПоУмолчанию()

	Для Каждого СтрокаТовары Из Товары Цикл
		СтрокаТовары.СпособФормированияСерийногоНомера = Перечисления.СпособыФормированияСерийногоНомераСУЗ.Автоматически;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСпособФормированияСерийныхНомеров(Отказ)
	
	ТаблицаПроверки = Товары.Выгрузить(, "GTIN, СпособФормированияСерийногоНомера");
	ТаблицаПроверки.Свернуть("GTIN, СпособФормированияСерийногоНомера");
	ТаблицаПроверки.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаПроверки.ЗаполнитьЗначения(1, "Количество");
	ТаблицаПроверки.Свернуть("GTIN", "Количество");
	
	Для Каждого СтрокаПроверки Из ТаблицаПроверки Цикл
	
		Если СтрокаПроверки.Количество < 2 Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("GTIN", СтрокаПроверки.GTIN));
		Для Каждого СтрокаТЧ Из НайденныеСтроки Цикл
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'В строке %1 для GTIN %2 отличается способ формирования серийных номеров от других строк'"),
				СтрокаТЧ.НомерСтроки, СтрокаТЧ.GTIN);
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"Товары", СтрокаТЧ.НомерСтроки, "СпособФормированияСерийногоНомера"),,
				Отказ);
				
			Прервать;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеСерийныхНомеров(Отказ)
	
	Для Каждого СтрокаТЧ Из Товары Цикл
	
		Если СтрокаТЧ.СпособФормированияСерийногоНомера <> Перечисления.СпособыФормированияСерийногоНомераСУЗ.Самостоятельно Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = СерийныеНомера.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТЧ.ИдентификаторСтроки));
		Если СтрокаТЧ.Количество <> НайденныеСтроки.Количество() Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru = 'В строке %1 указано серийных номеров: %2. Требуется указать: %3'"),
				СтрокаТЧ.НомерСтроки,
				Формат(НайденныеСтроки.Количество(), "ЧН=0; ЧГ=0;"),
				Формат(СтрокаТЧ.Количество, "ЧН=0; ЧГ=0;"));
			
			ОбщегоНазначения.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти(
					"Товары", СтрокаТЧ.НомерСтроки, "СпособФормированияСерийногоНомера"),,
				Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОбъектПоСтатистике()
	
	ДанныеСтатистики = ЗаполнениеОбъектовПоСтатистикеИСМП.ДанныеЗаполненияЗаказаНаЭмиссиюКодовМаркировкиСУЗ(Организация);
	
	Для Каждого КлючИЗначение Из ДанныеСтатистики Цикл
		ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьПустойРеквизит(ЭтотОбъект, ДанныеСтатистики, КлючИЗначение.Ключ);
	КонецЦикла;
	
	ПроверитьАктуальностьСпособаВводаВОборот();
	
	ИсходныеДанныеСодержатGTIN = Ложь;
	
	Для Каждого СтрокаТовары Из Товары Цикл
		Если ЗначениеЗаполнено(СтрокаТовары.GTIN) Тогда
			ИсходныеДанныеСодержатGTIN = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ИсходныеДанныеСодержатGTIN Тогда
		ДополнительныеПоляПоиска = "GTIN";
	КонецЕсли;
	
	ЗаполнениеОбъектовПоСтатистикеИСМП.ЗаполнитьДанныеПоТоварамЗаказаНаЭмиссиюКодовМаркировкиСУЗ(
		ЭтотОбъект,, ДополнительныеПоляПоиска);
	
КонецПроцедуры

Процедура ЗаполнитьПоПеремаркировке(ДанныеЗаполнения)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьШапку") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, 
			ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация,ТоварнаяГруппа"));
		
		СпособВводаВОборот = ПредопределенноеЗначение("Перечисление.СпособыВводаВОборотСУЗ.Перемаркировка");
		
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Основание",          ДанныеЗаполнения);
		Запрос.УстановитьПараметр("Ссылка",             Ссылка);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремаркировкаТоваровИСМПТовары.НоваяНоменклатура   КАК Номенклатура,
		|	ПеремаркировкаТоваровИСМПТовары.НоваяХарактеристика КАК Характеристика,
		|	1                                                   КАК Количество
		|ПОМЕСТИТЬ ТоварыПеремаркировки
		|ИЗ
		|	Документ.ПеремаркировкаТоваровИСМП.Товары КАК ПеремаркировкаТоваровИСМПТовары
		|ГДЕ
		|	ПеремаркировкаТоваровИСМПТовары.Ссылка = &Основание
		|	И ПеремаркировкаТоваровИСМПТовары.НовыйКодМаркировки = ЗНАЧЕНИЕ(Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка)
		|;
		|/////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	ПеремаркировкаТоваровИСМПТовары.Номенклатура      КАК Номенклатура,
		|	ПеремаркировкаТоваровИСМПТовары.Характеристика    КАК Характеристика,
		|	СУММА(ПеремаркировкаТоваровИСМПТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ НеобходимоЗаказать
		|ИЗ
		|	ТоварыПеремаркировки КАК ПеремаркировкаТоваровИСМПТовары
		|СГРУППИРОВАТЬ ПО
		|	ПеремаркировкаТоваровИСМПТовары.Номенклатура,
		|	ПеремаркировкаТоваровИСМПТовары.Характеристика
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПулКодовМаркировкиСУЗ.Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика,
		|	СУММА(-1)
		|ИЗ
		|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
		|ГДЕ
		|	ПулКодовМаркировкиСУЗ.ДокументОснование = &Основание
		|	И ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию.ДокументОснование <> &Основание
		|СГРУППИРОВАТЬ ПО
		|	ПулКодовМаркировкиСУЗ.Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаЭмиссию.Номенклатура,
		|	ЗаказНаЭмиссию.Характеристика,
		|	-СУММА(ЗаказНаЭмиссию.Количество)
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссию
		|ГДЕ
		|	ЗаказНаЭмиссию.Ссылка.ДокументОснование = &Основание
		|	И ЗаказНаЭмиссию.Ссылка <> &Ссылка
		|	И НЕ ЗаказНаЭмиссию.Ссылка.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаЭмиссию.Номенклатура,
		|	ЗаказНаЭмиссию.Характеристика
		|;
		|ВЫБРАТЬ
		|	НеобходимоЗаказать.Номенклатура      КАК Номенклатура,
		|	НеобходимоЗаказать.Характеристика    КАК Характеристика,
		|	СУММА(НеобходимоЗаказать.Количество) КАК Количество,
		|	СУММА(НеобходимоЗаказать.Количество) КАК КоличествоУпаковок
		|ИЗ
		|	НеобходимоЗаказать КАК НеобходимоЗаказать
		|СГРУППИРОВАТЬ ПО
		|	НеобходимоЗаказать.Номенклатура,
		|	НеобходимоЗаказать.Характеристика
		|ИМЕЮЩИЕ
		|	СУММА(НеобходимоЗаказать.Количество) > 0
		|";
		
		ЗаполнитьТабличнуюЧастьТовары(Запрос);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоМаркировке(ДанныеЗаполнения)
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьШапку") Тогда
		
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ДокументОснование,
			"Организация,
			|ТоварнаяГруппа,
			|ИдентификаторПроизводственногоЗаказа,
			|ИдентификаторПроизводственнойЛинии,
			|Операция,
			|Контрагент");
		
		Если Реквизиты.Операция = Перечисления.ВидыОперацийИСМП.ПодтверждениеПоступленияКИЗ Тогда
			Возврат;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Реквизиты);
		
		Если Реквизиты.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков
			Или ОснованиеМаркировкиТоваровОтноситсяКМаркировкеОстатков() Тогда
			Если ЗаказНаЭмиссиюСУЗКлиентСервер.ДоступенСпособВводаВОборот(
				ТоварнаяГруппа, Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков) Тогда
				СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков;
			Иначе
				СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаВнеПроизводстваИмпорта;
			КонецЕсли;
			СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков;
		ИначеЕсли Реквизиты.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПроизводствоВнеЕАЭС
			Или Реквизиты.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотИмпортСФТС Тогда
			СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Импорт;
		ИначеЕсли Реквизиты.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотТрансграничнаяТорговля Тогда
			СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.ТрансграничнаяТорговля;
		ИначеЕсли Реквизиты.Операция = Перечисления.ВидыОперацийИСМП.ВводВОборотПолучениеПродукцииОтФизическихЛиц Тогда
			СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Комиссия;
		Иначе
			СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.Производство;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("НеЗаполнятьТабличнуюЧасть") Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Основание", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр(
			"ПустыеЗначенияНоменклатуры",
			ИнтеграцияИС.НезаполненныеЗначенияОпределяемогоТипа("Номенклатура"));
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркировкаТоваровИСМПТовары.Номенклатура КАК Номенклатура,
		|	МаркировкаТоваровИСМПТовары.Характеристика КАК Характеристика,
		|	&ШаблонМаркировкаТовары КАК Шаблон,
		|	СУММА(МаркировкаТоваровИСМПТовары.Количество) / ЕСТЬNULL(ОписаниеНоменклатурыИС.КоличествоВПотребительскойУпаковке,1) КАК Количество,
		|	ВЫБОР
		|		КОГДА МаркировкаТоваровИСМПТовары.Номенклатура В (&ПустыеЗначенияНоменклатуры)
		|			ТОГДА МаркировкаТоваровИСМПТовары.GTIN
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ КАК GTIN,
		|	ВЫБОР
		|		КОГДА МаркировкаТоваровИСМПТовары.Ссылка.Операция = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК МаркировкаОстатков
		|ПОМЕСТИТЬ НеобходимоЗаказать
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.Товары КАК МаркировкаТоваровИСМПТовары
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО &ТоварыОписаниеНоменклатурыИС
		|ГДЕ
		|	МаркировкаТоваровИСМПТовары.Ссылка = &Основание
		|	И Не (&ТребуетВзвешивания)
		|СГРУППИРОВАТЬ ПО
		|	МаркировкаТоваровИСМПТовары.Номенклатура,
		|	МаркировкаТоваровИСМПТовары.Характеристика,
		|	&ШаблонМаркировкаТовары,
		|	ВЫБОР
		|		КОГДА МаркировкаТоваровИСМПТовары.Номенклатура В (&ПустыеЗначенияНоменклатуры)
		|			ТОГДА МаркировкаТоваровИСМПТовары.GTIN
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА МаркировкаТоваровИСМПТовары.Ссылка.Операция = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ОписаниеНоменклатурыИС.КоличествоВПотребительскойУпаковке
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Штрихкоды.Номенклатура,
		|	Штрихкоды.Характеристика,
		|	&ШаблонМаркировкаШтрихкоды,
		|	-СУММА(ВЫБОР
		|			КОГДА Штрихкоды.КоличествоПотребительскихУпаковок <> 0
		|				ТОГДА Штрихкоды.КоличествоПотребительскихУпаковок
		|			КОГДА Штрихкоды.Количество <> 0
		|				ТОГДА Штрихкоды.Количество
		|			ИНАЧЕ 1 КОНЕЦ),
		|	Неопределено,
		|	ВЫБОР
		|		КОГДА МаркировкаТоваровИСМПШтрихкоды.Ссылка.Операция = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	Документ.МаркировкаТоваровИСМП.ШтрихкодыУпаковок КАК МаркировкаТоваровИСМПШтрихкоды
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК Штрихкоды
		|		ПО Штрихкоды.Ссылка = МаркировкаТоваровИСМПШтрихкоды.ШтрихкодУпаковки
		|ГДЕ
		|	МаркировкаТоваровИСМПШтрихкоды.Ссылка = &Основание
		|СГРУППИРОВАТЬ ПО
		|	Штрихкоды.Номенклатура,
		|	Штрихкоды.Характеристика,
		|	&ШаблонМаркировкаШтрихкоды,
		|	ВЫБОР
		|		КОГДА МаркировкаТоваровИСМПШтрихкоды.Ссылка.Операция = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийИСМП.ВводВОборотМаркировкаОстатков)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПулКодовМаркировкиСУЗ.Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.ШаблоныКодовМаркировкиСУЗ.ПустаяСсылка),
		|	СУММА(-1),
		|	ВЫБОР
		|		КОГДА ПулКодовМаркировкиСУЗ.Номенклатура В (&ПустыеЗначенияНоменклатуры)
		|			ТОГДА ПулКодовМаркировкиСУЗ.GTIN
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ,
		|	ПулКодовМаркировкиСУЗ.МаркировкаОстатков
		|ИЗ
		|	РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
		|ГДЕ
		|	ПулКодовМаркировкиСУЗ.ДокументОснование = &Основание
		|	И ПулКодовМаркировкиСУЗ.ЗаказНаЭмиссию.ДокументОснование <> &Основание
		|СГРУППИРОВАТЬ ПО
		|	ПулКодовМаркировкиСУЗ.Номенклатура,
		|	ПулКодовМаркировкиСУЗ.Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.ШаблоныКодовМаркировкиСУЗ.ПустаяСсылка),
		|	ВЫБОР
		|		КОГДА ПулКодовМаркировкиСУЗ.Номенклатура В (&ПустыеЗначенияНоменклатуры)
		|			ТОГДА ПулКодовМаркировкиСУЗ.GTIN
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ,
		|	ПулКодовМаркировкиСУЗ.МаркировкаОстатков
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗаказНаЭмиссию.Номенклатура,
		|	ЗаказНаЭмиссию.Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.ШаблоныКодовМаркировкиСУЗ.ПустаяСсылка),
		|	-СУММА(ЗаказНаЭмиссию.Количество),
		|	ВЫБОР
		|		КОГДА ЗаказНаЭмиссию.Номенклатура В (&ПустыеЗначенияНоменклатуры)
		|			ТОГДА ЗаказНаЭмиссию.GTIN
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗаказНаЭмиссию.Ссылка.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссию
		|ГДЕ
		|	ЗаказНаЭмиссию.Ссылка.ДокументОснование = &Основание
		|	И ЗаказНаЭмиссию.Ссылка <> &Ссылка
		|	И ЗаказНаЭмиссию.Ссылка.Проведен
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаЭмиссию.Номенклатура,
		|	ЗаказНаЭмиссию.Характеристика,
		|	ЗНАЧЕНИЕ(Справочник.ШаблоныКодовМаркировкиСУЗ.ПустаяСсылка),
		|	ВЫБОР
		|		КОГДА ЗаказНаЭмиссию.Номенклатура В (&ПустыеЗначенияНоменклатуры)
		|			ТОГДА ЗаказНаЭмиссию.GTIN
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗаказНаЭмиссию.Ссылка.СпособВводаВОборот = ЗНАЧЕНИЕ(Перечисление.СпособыВводаВОборотСУЗ.МаркировкаОстатков)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		|;
		|ВЫБРАТЬ
		|	НеобходимоЗаказать.Номенклатура           КАК Номенклатура,
		|	НеобходимоЗаказать.Характеристика         КАК Характеристика,
		|	НеобходимоЗаказать.Шаблон                 КАК Шаблон,
		|	СУММА(НеобходимоЗаказать.Количество)      КАК Количество,
		|	СУММА(НеобходимоЗаказать.Количество)      КАК КоличествоУпаковок,
		|	НеобходимоЗаказать.GTIN                   КАК GTIN
		|ИЗ
		|	НеобходимоЗаказать КАК НеобходимоЗаказать
		|СГРУППИРОВАТЬ ПО
		|	НеобходимоЗаказать.Номенклатура,
		|	НеобходимоЗаказать.Характеристика,
		|	НеобходимоЗаказать.Шаблон,
		|	НеобходимоЗаказать.GTIN
		|ИМЕЮЩИЕ
		|	СУММА(НеобходимоЗаказать.Количество) > 0
		|";
		ОбщегоНазначенияИС.ОбновитьТекстЗапросаСРегистромОписаниеНоменклатурыИС(Запрос.Текст, "ОписаниеНоменклатурыИС", "МаркировкаТоваровИСМПТовары.Номенклатура");
		
		ВидыПродукцииПоТоварнойГруппе = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(ТоварнаяГруппа);
		
		Если ИнтеграцияИСМПВЕТИСКлиентСервер.ЭтоВидПродукцииИСМПВЕТИС(ВидыПродукцииПоТоварнойГруппе) Тогда
			ИнтеграцияИСМПВЕТИС.ДоработатьЗапросЗаполненияЗаказаНаЭмиссиюПоМаркировке(Запрос);
		КонецЕсли;
		
		Подстановка = "ЗНАЧЕНИЕ(Справочник.ШаблоныКодовМаркировкиСУЗ.ПустаяСсылка)";
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ШаблонМаркировкаТовары", Подстановка);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ШаблонМаркировкаШтрихкоды", Подстановка);
		ЗаполнитьТабличнуюЧастьТовары(Запрос);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьТовары(Запрос)
	
	Выборка = Запрос.Выполнить().Выбрать();
	Товары.Очистить();
	Пока Выборка.Следующий() Цикл
		Строка = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, Выборка);
		Если Не ЗначениеЗаполнено(Строка.Шаблон) Тогда
			Строка.Шаблон = ИнтеграцияИСМПКлиентСервер.ШаблонКодаМаркировкиПоВидуПродукции(ТоварнаяГруппа);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьИдентификаторыСтрокТабличнойЧастиТовары()
	
	Для Каждого СтрокаТовары Из Товары Цикл
		
		Если ПустаяСтрока(СтрокаТовары.ИдентификаторСтроки) Тогда
			СтрокаТовары.ИдентификаторСтроки = Новый УникальныйИдентификатор();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОснованиеМаркировкиТоваровОтноситсяКМаркировкеОстатков()
	
	//@skip-warning
	ОснованиеМаркировки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДокументОснование");
	Если Не ЗначениеЗаполнено(ОснованиеМаркировки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЯвляетсяОснованиемДляМаркировкиОстатков = Ложь;
	
	ИнтеграцияИСМППереопределяемый.ЯвляетсяОснованиемДляМаркировкиОстатков(
		ОснованиеМаркировки,
		ЯвляетсяОснованиемДляМаркировкиОстатков);
	
	Возврат ЯвляетсяОснованиемДляМаркировкиОстатков;
	
КонецФункции

Процедура ПроверитьАктуальностьСпособаВводаВОборот()
	
	ВидыПродукцииПоТоварнойГруппе = КонструкторИСМПОбщегоНазначенияКлиентСервер.ВидыПродукцииПоТоварнойГруппе(ТоварнаяГруппа);
	ДоступнаМаркировкаОстатков    = Ложь;
	
	Для каждого ВидПродукции Из ВидыПродукцииПоТоварнойГруппе Цикл
		Если ИнтеграцияИСКлиентСервер.ВидПродукцииПодлежитМаркировкеОстатков(ВидПродукции) Тогда
			ДоступнаМаркировкаОстатков = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Если СпособВводаВОборот = Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков И Не ДоступнаМаркировкаОстатков Тогда
		СпособВводаВОборот                                  = Неопределено;
		ВвезенПослеДатыОбязательнойМаркировки               = Ложь;
		ПриобретенПроизведенПослеДатыОбязательнойМаркировки = Ложь;
		БезУчетаНоменклатуры                                = Ложь;
		Товары.Очистить();
		СерийныеНомера.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
